# Challenge Questions - Employees Dataset

# Instructions:
• Please ensure you don't overwrite any existing cells. Add new cells below by pressing ALT+ENTER

• Attempt all of the questions

• You are encouraged to look online for help should you need it

# Dataset overview:
There are three csv files containing tables stored in the same directory as this Notebook, they are all related to each other:

• **employees.csv**: contains information about employees in a company. It contains their unique employee number (emp_no), their department number (dept_no), their hire date (hire_date) and their leaving date (leaving_date). The leaving date is blank if the employee is still employed by the company

• **departments.csv**: This contains information about the departments in a company. It contains the deparment number (dept_no), the department name (dept_name) and location.

• **salaries.csv**: This file contains the salaries of the employees. It contains a unique employee department key (emp_dept_key) and the salary. The emp_dept_key is in the format 'emp_id-dept_id'

#

## Import pandas, numpy and datetime

In [2]:
import pandas as pd

In [3]:
import numpy as np
import datetime as dt

## Load the files:
• "employees.csv" should be assigned to the variable **emp**

• "departments.csv" should be assigned to the variable **dept**

• "salaries.csv" should be assigned to the variable **sal**

In [4]:
a=pd.read_csv("employees.csv")

In [5]:
b=pd.read_csv("departments.csv")
c=pd.read_csv("salaries.csv")

## Check the head of all three DataFrames

In [6]:
a.head()

   emp_no dept_no   hire_date leaving_date
0   10001      D5  26/06/2006          NaN
1   10002      D6  21/11/2005          NaN
2   10003      D4  28/08/2006          NaN
3   10004      D4  01/12/2006          NaN
4   10005      D3  12/09/2009          NaN

In [7]:
b.head()
c.head()

  emp_dept_key  salary
0     10001-D5   30546
1     10002-D6   36536
2     10003-D4   38323
3     10004-D4   31851
4     10005-D3   53435

## Check the data types of all three DataFrames

In [8]:
b.dtypes

dept_no      object
dept_name    object
location     object
dtype: object

In [9]:
a.dtypes

emp_no           int64
dept_no         object
hire_date       object
leaving_date    object
dtype: object

In [10]:
c.dtypes

emp_dept_key    object
salary           int64
dtype: object

## Change the data types accordingly. 

• emp_no, dept_no, dept_name, location, emp_depy_key should all be string data types

• hire_date and leaving_date should be datetime64

• salary should be int64

In [11]:
a[['emp_no','dept_no']]=a[['emp_no','dept_no']].astype('string')

In [12]:
b[['dept_name','location']]=b[['dept_name','location']].astype('string')

In [13]:
c['emp_dept_key'] = c['emp_dept_key'].astype('string')

## How many employees are currently working at the company. 

The employees still employed do not have a leaving date value. You can use the isnull() method to identify nulls or NaN values.

isnull(): https://pandas.pydata.org/docs/reference/api/pandas.isnull.html

In [14]:
a['leaving_date'].isnull().count()

1000

## How many currently employed people are there per department.

In [17]:
current_emp = a[a['leaving_date'].isnull() == True]
current_emp.groupby(by='dept_no').count()['emp_no']

dept_no
D1     84
D2     36
D3     94
D4    171
D5    188
D6    168
Name: emp_no, dtype: int64

## Perform a left join on the emp and dept DataFrames (with emp as the left DF). Assign the result of this to the variable emp_dept

In [18]:
emp_dept = pd.merge(left=a,right=b,left_on='dept_no', right_on = 'dept_no', how='left')

In [19]:
emp_dept

    emp_no dept_no   hire_date leaving_date                dept_name  location
0    10001      D5  26/06/2006          NaN               Technology   Chicago
1    10002      D6  21/11/2005          NaN                    Sales   Chicago
2    10003      D4  28/08/2006          NaN                Marketing  New York
3    10004      D4  01/12/2006          NaN                Marketing  New York
4    10005      D3  12/09/2009          NaN  Supply Chain Operations   Chicago
..     ...     ...         ...          ...                      ...       ...
995  10903      D1  14/02/2009          NaN   Accounting and Finance   Chicago
996  10904      D5  16/04/2013          NaN               Technology   Chicago
997  10905      D4  28/02/2005   07/03/2006                Marketing  New York
998  10906      D2  20/01/2014   25/04/2021          Human Resources  New York
999  10906      D6  20/01/2014          NaN                    Sales   Chicago

[1000 rows x 6 columns]

## Perform a left join on the newly created "emp_dept" DataFrame and the "sal" DataFrame. 
## Assign this resulting DataFrame to the variable "emp_dept_sal"

• You will need to think about how to join the two tables. Note the emp_dept_key on the sal DataFrame is in the format 'emp_id-dept_id'

In [21]:
c['emp_no']=c['emp_dept_key'].apply(lambda x: x[:5])
emp_dept_sal=pd.merge(left=emp_dept,right=c,how='left',right_on='emp_no',left_on='emp_no')

## Drop the column "emp_dept_key"

In [22]:
emp_dept_sal.drop(columns='emp_dept_key',inplace=True)

## What is the average salary per department?

In [23]:
emp_dept_sal[['dept_name','salary']].groupby(by='dept_name').mean()

                               salary
dept_name
Accounting and Finance   52148.887324
Human Resources          44849.602740
Marketing                41540.041985
Sales                    59192.053640
Supply Chain Operations  45183.788462
Technology               58975.979592

## What is the average salary by location?

In [24]:
emp_dept_sal[['location','salary']].groupby(by='location').mean()

                salary
location
Chicago   55383.208675
New York  42261.229851

## How many people were hired each year in each of the last 10 years?